src/BusinessProcesses/Job.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.3">
	<BusinessProcess>
		<Properties>
			<Name>Job</Name>
			<BasedOn>
				<xr:Item>Catalog.Users</xr:Item>
				<xr:Item>Task.PerformerTask</xr:Item>
			</BasedOn>
			<Task>Task.PerformerTask</Task>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Author</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Users</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Importance</Name>
					<Comment>Importance of tasks at action point Execute for performer</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.TaskImportanceVariants</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Finished</Name>
					<Comment>Job execution result after the business process is completed.</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>MainTask</Name>
					<Type>
						<v8:Type>cfg:TaskRef.PerformerTask</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CompletionDate</Name>
					<Comment>Actual business process completion date</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Performer</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.PerformerRoles</v8:Type>
						<v8:Type>cfg:CatalogRef.Users</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Description</Name>
					<Comment>Job details</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>OnValidation</Name>
					<Comment>This flag shows that task supervisor is specified</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>IterationNumber</Name>
					<Comment>Number of business process cycles between performer and supervisor</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Confirmed</Name>
					<Comment>Internal business process state</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Subject</Name>
					<Comment>System object on which behalf the business process was created.</Comment>
					<Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
						<v8:TypeSet>cfg:TaskRef</v8:TypeSet>
						<v8:TypeSet>cfg:ChartOfCharacteristicTypesRef</v8:TypeSet>
						<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Supervisor</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.PerformerRoles</v8:Type>
						<v8:Type>cfg:CatalogRef.Users</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ExecutionResult</Name>
					<Comment>Correspondence history between performer and supervisor</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Content</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>State</Name>
					<Type>
						<v8:Type>cfg:EnumRef.BusinessProcessStates</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DueDate</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>VerificationDueDate</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>AuthorString</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ExternalJob</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>SourceTask</Name>
					<Type>
						<v8:Type>cfg:TaskRef.PerformerTask</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>SubjectContent</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</BusinessProcess>
</MetaDataObject>

src/BusinessProcesses/Job/Forms/ListForm/Ext/Form/Module.bsl
#Region FormEventHandlers

&AtServer
Procedure OnCreateAtServer(Cancel, StandardProcessing)
	
	// Skipping the initialization to guarantee that the form will be received if the Autotest parameter is passed.
	If Parameters.Property("Autotest") Then 
		Return;
	EndIf;
	
	ByAuthor = Users.CurrentUser();
	
	CommonUseClientServer.SetDynamicListFilterItem(
		List, "SourceTask", Tasks.PerformerTask.EmptyRef());
	
	SetFilter();
	UseDateAndTimeInTaskDeadlines = GetFunctionalOption("UseDateAndTimeInTaskDeadlines");
	Items.DueDate.Format = ?(UseDateAndTimeInTaskDeadlines, "DLF=DT", "DLF=D");
	Items.VerificationDueDate.Format = ?(UseDateAndTimeInTaskDeadlines, "DLF=DT", "DLF=D");
	BusinessProcessesAndTasksServer.SetBusinessProcessAppearance(List.ConditionalAppearance);
	
	CommonUseClientServer.MoveFiltersToDynamicList(ThisObject);
EndProcedure

&AtServer
Procedure OnLoadDataFromSettingsAtServer(Settings)
	SetListFilter(Settings);	
EndProcedure

#EndRegion

#Region FormHeaderItemEventHandlers

&AtClient
Procedure ByAuthorOnChange(Item)
	SetFilter();
EndProcedure

&AtClient
Procedure ByPerformerOnChange(Item)
	SetFilter();
EndProcedure

&AtClient
Procedure BySupervisorOnChange(Item)
	SetFilter();
EndProcedure

&AtClient
Procedure ShowCompletedJobsOnChange(Item)
	SetFilter();
EndProcedure

&AtClient
Procedure ShowStoppedOnChange(Item)
	
	SetFilter();
	
EndProcedure

#EndRegion

#Region FormCommandHandlers

&AtClient
Procedure Stop(Command)
	
	BusinessProcessesAndTasksClient.Stop(Items.List.SelectedRows);
	
EndProcedure

&AtClient
Procedure ContinueBusinessProcess(Command)
	
	BusinessProcessesAndTasksClient.Activate(Items.List.SelectedRows);
	
EndProcedure

#EndRegion

#Region InternalProceduresAndFunctions

&AtServer
Procedure SetFilter()
	FilterParameters = New Map();
	FilterParameters.Insert("ShowCompletedJobs", ShowCompletedJobs);	
	FilterParameters.Insert("ShowStopped", ShowStopped);	
	FilterParameters.Insert("ByAuthor", ByAuthor);
	FilterParameters.Insert("ByPerformer", ByPerformer);
	FilterParameters.Insert("BySupervisor", BySupervisor);
	SetListFilter(FilterParameters);
EndProcedure	

&AtServer
Procedure SetListFilter(FilterParameters)
	
	CommonUseClientServer.SetDynamicListFilterItem(List, "Completed", False,,,
		Not FilterParameters["ShowCompletedJobs"]);
	CommonUseClientServer.SetDynamicListFilterItem(List, "Stopped", False,,,
		Not FilterParameters["ShowStopped"]);
	CommonUseClientServer.SetDynamicListFilterItem(List, "Author", FilterParameters["ByAuthor"],,,
		Not FilterParameters["ByAuthor"].IsEmpty());
	CommonUseClientServer.SetDynamicListFilterItem(List, "Performer", FilterParameters["ByPerformer"],,,
		Not FilterParameters["ByPerformer"].IsEmpty());
	CommonUseClientServer.SetDynamicListFilterItem(List, "Supervisor", FilterParameters["BySupervisor"],,,
		Not FilterParameters["BySupervisor"].IsEmpty());
	
EndProcedure

#EndRegion
